 printf("****************************************");
    printf("*                                      *");
    printf("*          游标式屏幕菜单示例        *");
    printf("*                                      *");
    printf("*           菜单项一                   *");
    printf("*          >菜单项二                   *");
    printf("*           菜单项三                   *");
    printf("*           退出                       *");
    printf("*                                      *");
    printf("****************************************");


    printf("****************************************");
    printf("*                                      *");
    printf("*          游标式屏幕菜单示例        *");
    printf("*                                      *");
    printf("*           菜单项一                   *");
    printf("*           菜单项二                   *");
    printf("*          >菜单项三                   *");
    printf("*           退出                       *");
    printf("*                                      *");
    printf("****************************************");


    printf("****************************************");
    printf("*                                      *");
    printf("*          游标式屏幕菜单示例        *");
    printf("*                                      *");
    printf("*           菜单项一                   *");
    printf("*           菜单项二                   *");
    printf("*           菜单项三                   *");
    printf("*          >退出                       *");
    printf("*                                      *");
    printf("****************************************");